app/controllers/ice_cream_controller.rb

SELECT "ice_creams".* FROM "ice_creams"
---
   def index
       @ice_cream = IceCream.all

SELECT "ice_creams".* FROM "ice_creams" WHERE "ice_creams"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
   def show
        @ice_cream = IceCream.find(params[:id])